---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSetIterator.#ctor
source: html/eb7d90ef-d2aa-e024-7834-b6394369e88f.htm
---
# Autodesk.Revit.DB.PanelTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public PanelTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.